---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MarkupsPrivate
source: html/2b002dd8-323c-b67d-b21f-19308b87a741.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MarkupsPrivate Property

"Private"

## Syntax (C#)
```csharp
public static ForgeTypeId MarkupsPrivate { get; }
```